avrdudes/avr-libc/include/avr/ioavr64da28s.h
/*
--------------------------------------------------------------------------
ADC - Analog to Digital Converter
--------------------------------------------------------------------------
*/

/* Analog to Digital Converter */
typedef struct ADC_struct
{
    register8_t CTRLA;  /* Control A */
    register8_t CTRLB;  /* Control B */
    register8_t CTRLC;  /* Control C */
    register8_t CTRLD;  /* Control D */
    register8_t CTRLE;  /* Control E */
    register8_t SAMPCTRL;  /* Sample Control */
    register8_t reserved_1[2];
    register8_t MUXPOS;  /* Positive mux input */
    register8_t MUXNEG;  /* Negative mux input */
    register8_t COMMAND;  /* Command */
    register8_t EVCTRL;  /* Event Control */
    register8_t INTCTRL;  /* Interrupt Control */
    register8_t INTFLAGS;  /* Interrupt Flags */
    register8_t DBGCTRL;  /* Debug Control */
    register8_t TEMP;  /* Temporary Data */
    _WORDREGISTER(RES);  /* ADC Accumulator Result */
    _WORDREGISTER(WINLT);  /* Window comparator low threshold */
    _WORDREGISTER(WINHT);  /* Window comparator high threshold */
    register8_t reserved_2[2];
} ADC_t;

/* Conversion mode select bit group values */
typedef enum ADC_CONVMODE_VALUES_enum
{
    ADC_CONVMODE_SINGLEENDED_gv    = 0x00,  /* Single-Ended mode */
    ADC_CONVMODE_DIFF_gv           = 0x01   /* Differential mode */
} ADC_CONVMODE_values_t;

/* Conversion mode select bit group configurations*/
typedef enum ADC_CONVMODE_enum
{
    ADC_CONVMODE_SINGLEENDED_gc    = (ADC_CONVMODE_SINGLEENDED_gv << ADC_CONVMODE_bp),  /* Single-Ended mode */
    ADC_CONVMODE_DIFF_gc           = (ADC_CONVMODE_DIFF_gv << ADC_CONVMODE_bp)   /* Differential mode */
} ADC_CONVMODE_t;

/* Initial Delay Selection bit group values */
typedef enum ADC_INITDLY_VALUES_enum
{
    ADC_INITDLY_DLY0_gv            = 0x00,  /* Delay 0 CLK_ADC cycles */
    ADC_INITDLY_DLY16_gv           = 0x01,  /* Delay 16 CLK_ADC cycles */
    ADC_INITDLY_DLY32_gv           = 0x02,  /* Delay 32 CLK_ADC cycles */
    ADC_INITDLY_DLY64_gv           = 0x03,  /* Delay 64 CLK_ADC cycles */
    ADC_INITDLY_DLY128_gv          = 0x04,  /* Delay 128 CLK_ADC cycles */
    ADC_INITDLY_DLY256_gv          = 0x05   /* Delay 256 CLK_ADC cycles */
} ADC_INITDLY_values_t;

/* Initial Delay Selection bit group configurations*/
typedef enum ADC_INITDLY_enum
{
    ADC_INITDLY_DLY0_gc            = (ADC_INITDLY_DLY0_gv << ADC_INITDLY_gp),  /* Delay 0 CLK_ADC cycles */
    ADC_INITDLY_DLY16_gc           = (ADC_INITDLY_DLY16_gv << ADC_INITDLY_gp),  /* Delay 16 CLK_ADC cycles */
    ADC_INITDLY_DLY32_gc           = (ADC_INITDLY_DLY32_gv << ADC_INITDLY_gp),  /* Delay 32 CLK_ADC cycles */
    ADC_INITDLY_DLY64_gc           = (ADC_INITDLY_DLY64_gv << ADC_INITDLY_gp),  /* Delay 64 CLK_ADC cycles */
    ADC_INITDLY_DLY128_gc          = (ADC_INITDLY_DLY128_gv << ADC_INITDLY_gp),  /* Delay 128 CLK_ADC cycles */
    ADC_INITDLY_DLY256_gc          = (ADC_INITDLY_DLY256_gv << ADC_INITDLY_gp)   /* Delay 256 CLK_ADC cycles */
} ADC_INITDLY_t;

/* Analog Channel Selection Bits bit group values */
typedef enum ADC_MUXNEG_VALUES_enum
{
    ADC_MUXNEG_AIN0_gv             = 0x00,  /* ADC input pin 0 */
    ADC_MUXNEG_AIN1_gv             = 0x01,  /* ADC input pin 1 */
    ADC_MUXNEG_AIN2_gv             = 0x02,  /* ADC input pin 2 */
    ADC_MUXNEG_AIN3_gv             = 0x03,  /* ADC input pin 3 */
    ADC_MUXNEG_AIN4_gv             = 0x04,  /* ADC input pin 4 */
    ADC_MUXNEG_AIN5_gv             = 0x05,  /* ADC input pin 5 */
    ADC_MUXNEG_AIN6_gv             = 0x06,  /* ADC input pin 6 */
    ADC_MUXNEG_AIN7_gv             = 0x07,  /* ADC input pin 7 */
    ADC_MUXNEG_GND_gv              = 0x40,  /* Ground */
    ADC_MUXNEG_DAC0_gv             = 0x48   /* DAC0 */
} ADC_MUXNEG_values_t;

/* Analog Channel Selection Bits bit group configurations*/
typedef enum ADC_MUXNEG_enum
{
    ADC_MUXNEG_AIN0_gc             = (ADC_MUXNEG_AIN0_gv << ADC_MUXNEG_gp),  /* ADC input pin 0 */
    ADC_MUXNEG_AIN1_gc             = (ADC_MUXNEG_AIN1_gv << ADC_MUXNEG_gp),  /* ADC input pin 1 */
    ADC_MUXNEG_AIN2_gc             = (ADC_MUXNEG_AIN2_gv << ADC_MUXNEG_gp),  /* ADC input pin 2 */
    ADC_MUXNEG_AIN3_gc             = (ADC_MUXNEG_AIN3_gv << ADC_MUXNEG_gp),  /* ADC input pin 3 */
    ADC_MUXNEG_AIN4_gc             = (ADC_MUXNEG_AIN4_gv << ADC_MUXNEG_gp),  /* ADC input pin 4 */
    ADC_MUXNEG_AIN5_gc             = (ADC_MUXNEG_AIN5_gv << ADC_MUXNEG_gp),  /* ADC input pin 5 */
    ADC_MUXNEG_AIN6_gc             = (ADC_MUXNEG_AIN6_gv << ADC_MUXNEG_gp),  /* ADC input pin 6 */
    ADC_MUXNEG_AIN7_gc             = (ADC_MUXNEG_AIN7_gv << ADC_MUXNEG_gp),  /* ADC input pin 7 */
    ADC_MUXNEG_GND_gc              = (ADC_MUXNEG_GND_gv << ADC_MUXNEG_gp),  /* Ground */
    ADC_MUXNEG_DAC0_gc             = (ADC_MUXNEG_DAC0_gv << ADC_MUXNEG_gp)   /* DAC0 */
} ADC_MUXNEG_t;

/* Analog Channel Selection Bits bit group values */
typedef enum ADC_MUXPOS_VALUES_enum
{
    ADC_MUXPOS_AIN0_gv             = 0x00,  /* ADC input pin 0 */
    ADC_MUXPOS_AIN1_gv             = 0x01,  /* ADC input pin 1 */
    ADC_MUXPOS_AIN2_gv             = 0x02,  /* ADC input pin 2 */
    ADC_MUXPOS_AIN3_gv             = 0x03,  /* ADC input pin 3 */
    ADC_MUXPOS_AIN4_gv             = 0x04,  /* ADC input pin 4 */
    ADC_MUXPOS_AIN5_gv             = 0x05,  /* ADC input pin 5 */
    ADC_MUXPOS_AIN6_gv             = 0x06,  /* ADC input pin 6 */
    ADC_MUXPOS_AIN7_gv             = 0x07,  /* ADC input pin 7 */
    ADC_MUXPOS_AIN16_gv            = 0x10,  /* ADC input pin 16 */
    ADC_MUXPOS_AIN17_gv            = 0x11,  /* ADC input pin 17 */
    ADC_MUXPOS_GND_gv              = 0x40,  /* Ground */
    ADC_MUXPOS_TEMPSENSE_gv        = 0x42,  /* Temperature sensor */
    ADC_MUXPOS_DAC0_gv             = 0x48,  /* DAC0 */
    ADC_MUXPOS_DACREF0_gv          = 0x49,  /* DACREF0 */
    ADC_MUXPOS_DACREF1_gv          = 0x4A,  /* DACREF1 */
    ADC_MUXPOS_DACREF2_gv          = 0x4B   /* DACREF2 */
} ADC_MUXPOS_values_t;

/* Analog Channel Selection Bits bit group configurations*/
typedef enum ADC_MUXPOS_enum
{
    ADC_MUXPOS_AIN0_gc             = (ADC_MUXPOS_AIN0_gv << ADC_MUXPOS_gp),  /* ADC input pin 0 */
    ADC_MUXPOS_AIN1_gc             = (ADC_MUXPOS_AIN1_gv << ADC_MUXPOS_gp),  /* ADC input pin 1 */
    ADC_MUXPOS_AIN2_gc             = (ADC_MUXPOS_AIN2_gv << ADC_MUXPOS_gp),  /* ADC input pin 2 */
    ADC_MUXPOS_AIN3_gc             = (ADC_MUXPOS_AIN3_gv << ADC_MUXPOS_gp),  /* ADC input pin 3 */
    ADC_MUXPOS_AIN4_gc             = (ADC_MUXPOS_AIN4_gv << ADC_MUXPOS_gp),  /* ADC input pin 4 */
    ADC_MUXPOS_AIN5_gc             = (ADC_MUXPOS_AIN5_gv << ADC_MUXPOS_gp),  /* ADC input pin 5 */
    ADC_MUXPOS_AIN6_gc             = (ADC_MUXPOS_AIN6_gv << ADC_MUXPOS_gp),  /* ADC input pin 6 */
    ADC_MUXPOS_AIN7_gc             = (ADC_MUXPOS_AIN7_gv << ADC_MUXPOS_gp),  /* ADC input pin 7 */
    ADC_MUXPOS_AIN16_gc            = (ADC_MUXPOS_AIN16_gv << ADC_MUXPOS_gp),  /* ADC input pin 16 */
    ADC_MUXPOS_AIN17_gc            = (ADC_MUXPOS_AIN17_gv << ADC_MUXPOS_gp),  /* ADC input pin 17 */
    ADC_MUXPOS_GND_gc              = (ADC_MUXPOS_GND_gv << ADC_MUXPOS_gp),  /* Ground */
    ADC_MUXPOS_TEMPSENSE_gc        = (ADC_MUXPOS_TEMPSENSE_gv << ADC_MUXPOS_gp),  /* Temperature sensor */
    ADC_MUXPOS_DAC0_gc             = (ADC_MUXPOS_DAC0_gv << ADC_MUXPOS_gp),  /* DAC0 */
    ADC_MUXPOS_DACREF0_gc          = (ADC_MUXPOS_DACREF0_gv << ADC_MUXPOS_gp),  /* DACREF0 */
    ADC_MUXPOS_DACREF1_gc          = (ADC_MUXPOS_DACREF1_gv << ADC_MUXPOS_gp),  /* DACREF1 */
    ADC_MUXPOS_DACREF2_gc          = (ADC_MUXPOS_DACREF2_gv << ADC_MUXPOS_gp)   /* DACREF2 */
} ADC_MUXPOS_t;

/* Clock Pre-scaler select bit group values */
typedef enum ADC_PRESC_VALUES_enum
{
    ADC_PRESC_DIV2_gv              = 0x00,  /* CLK_PER divided by 2 */
    ADC_PRESC_DIV4_gv              = 0x01,  /* CLK_PER divided by 4 */
    ADC_PRESC_DIV8_gv              = 0x02,  /* CLK_PER divided by 8 */
    ADC_PRESC_DIV12_gv             = 0x03,  /* CLK_PER divided by 12 */
    ADC_PRESC_DIV16_gv             = 0x04,  /* CLK_PER divided by 16 */
    ADC_PRESC_DIV20_gv             = 0x05,  /* CLK_PER divided by 20 */
    ADC_PRESC_DIV24_gv             = 0x06,  /* CLK_PER divided by 24 */
    ADC_PRESC_DIV28_gv             = 0x07,  /* CLK_PER divided by 28 */
    ADC_PRESC_DIV32_gv             = 0x08,  /* CLK_PER divided by 32 */
    ADC_PRESC_DIV48_gv             = 0x09,  /* CLK_PER divided by 48 */
    ADC_PRESC_DIV64_gv             = 0x0A,  /* CLK_PER divided by 64 */
    ADC_PRESC_DIV96_gv             = 0x0B,  /* CLK_PER divided by 96 */
    ADC_PRESC_DIV128_gv            = 0x0C,  /* CLK_PER divided by 128 */
    ADC_PRESC_DIV256_gv            = 0x0D   /* CLK_PER divided by 256 */
} ADC_PRESC_values_t;

/* Clock Pre-scaler select bit group configurations*/
typedef enum ADC_PRESC_enum
{
    ADC_PRESC_DIV2_gc              = (ADC_PRESC_DIV2_gv << ADC_PRESC_gp),  /* CLK_PER divided by 2 */
    ADC_PRESC_DIV4_gc              = (ADC_PRESC_DIV4_gv << ADC_PRESC_gp),  /* CLK_PER divided by 4 */
    ADC_PRESC_DIV8_gc              = (ADC_PRESC_DIV8_gv << ADC_PRESC_gp),  /* CLK_PER divided by 8 */
    ADC_PRESC_DIV12_gc             = (ADC_PRESC_DIV12_gv << ADC_PRESC_gp),  /* CLK_PER divided by 12 */
    ADC_PRESC_DIV16_gc             = (ADC_PRESC_DIV16_gv << ADC_PRESC_gp),  /* CLK_PER divided by 16 */
    ADC_PRESC_DIV20_gc             = (ADC_PRESC_DIV20_gv << ADC_PRESC_gp),  /* CLK_PER divided by 20 */
    ADC_PRESC_DIV24_gc             = (ADC_PRESC_DIV24_gv << ADC_PRESC_gp),  /* CLK_PER divided by 24 */
    ADC_PRESC_DIV28_gc             = (ADC_PRESC_DIV28_gv << ADC_PRESC_gp),  /* CLK_PER divided by 28 */
    ADC_PRESC_DIV32_gc             = (ADC_PRESC_DIV32_gv << ADC_PRESC_gp),  /* CLK_PER divided by 32 */
    ADC_PRESC_DIV48_gc             = (ADC_PRESC_DIV48_gv << ADC_PRESC_gp),  /* CLK_PER divided by 48 */
    ADC_PRESC_DIV64_gc             = (ADC_PRESC_DIV64_gv << ADC_PRESC_gp),  /* CLK_PER divided by 64 */
    ADC_PRESC_DIV96_gc             = (ADC_PRESC_DIV96_gv << ADC_PRESC_gp),  /* CLK_PER divided by 96 */
    ADC_PRESC_DIV128_gc            = (ADC_PRESC_DIV128_gv << ADC_PRESC_gp),  /* CLK_PER divided by 128 */
    ADC_PRESC_DIV256_gc            = (ADC_PRESC_DIV256_gv << ADC_PRESC_gp)   /* CLK_PER divided by 256 */
} ADC_PRESC_t;

/* Resolution selection bit group values */
typedef enum ADC_RESSEL_VALUES_enum
{
    ADC_RESSEL_12BIT_gv            = 0x00,  /* 12-bit mode */
    ADC_RESSEL_10BIT_gv            = 0x01   /* 10-bit mode */
} ADC_RESSEL_values_t;

